eisup_2019_docmng_integration/src/Catalogs/ТипыЦенНоменклатуры/ТипыЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЦенНоменклатуры</name>
  <comment>(Упр)</comment>
  <attributes>
    <name>ВалютаЦены</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйТипЦен</name>
    <comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассчитывается</name>
    <comment>(Общ) Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <comment>(Общ) Истина - цена включает НДС, ложь - не включает</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругления</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьВБольшуюСторону</name>
    <comment>(Общ) Истина, то при порядке округления &quot;5&quot; 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаЦены</name>
    <type>
      <types>EnumRef.СпособыРасчетаЦены</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/ТипыЦенНоменклатуры/ObjectModule.bsl
// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ)

	Если НЕ ОбменДанными.Загрузка И ЗначениеЗаполнено(БазовыйТипЦен) Тогда
		// Если цена расчетная и введена на основании расчетной- это неправильно - записывать нельзя
		Если БазовыйТипЦен.Рассчитывается Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Базовый тип цен не может быть динамическим!", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если НЕ ОбменДанными.Загрузка И Не ЭтоГруппа Тогда
		Если Рассчитывается Тогда
			// Если цена расчетная и на основании её введена уже расчетная - это неправильно - записывать нельзя
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТекущийТипЦен", ЭтотОбъект.Ссылка);

			Запрос.Текст =
			"ВЫБРАТЬ
			|	ТипЦен.Рассчитывается КАК Рассчитывается,
			|	ТипЦен.БазовыйТипЦен КАК БазовыйТипЦен
			|ИЗ
			|	Справочник.ТипыЦенНоменклатуры КАК ТипЦен
			|
			|ГДЕ
			|	ТипЦен.БазовыйТипЦен = &ТекущийТипЦен
			| И ТипЦен.Рассчитывается = Истина";

			ВыборкаЦен = Запрос.Выполнить().Выбрать();
			Если ВыборкаЦен.Следующий() Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке("Этот тип цен уже используется как базовый, он уже не может быть динамическим!", Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если НЕ ОбменДанными.Загрузка Тогда
		НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель);
	КонецЕсли;
	
КонецПроцедуры
